patzomir/ac-home-assist/firmware/zigbee-hub/sdkconfig.defaults
# ESP32-C6 Zero — Zigbee Hub
# Target
CONFIG_IDF_TARGET="esp32c6"

# Flash size (ESP32-C6 Zero has 4 MB)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Zigbee — coordinator role
CONFIG_ZB_ENABLED=y
CONFIG_ZB_ZCL_SUPPORT_CLUSTER_BASIC=y
CONFIG_ZB_ZCL_SUPPORT_CLUSTER_IDENTIFY=y
CONFIG_ZB_ZCL_SUPPORT_CLUSTER_THERMOSTAT=y
CONFIG_ZB_ZCL_SUPPORT_CLUSTER_ON_OFF=y
CONFIG_ZB_ZCL_SUPPORT_CLUSTER_TIME=y

# Zigbee network settings
CONFIG_ZB_NETWORK_CHANNEL=11
CONFIG_ZB_COORDINATOR_ALL_MAC_RX_ON_WHEN_IDLE=y

# WiFi power save — off for hub (always on)
CONFIG_ESP_WIFI_SLP_IRAM_OPT=n

# HTTPD / HTTP client
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y

# FreeRTOS tick rate
CONFIG_FREERTOS_HZ=1000

# NVS for storing paired devices and schedule
CONFIG_NVS_ENCRYPTION=n

# SNTP for time sync
CONFIG_LWIP_SNTP_MAX_SERVERS=2

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# Stack sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
